API_Testing/CreateRequestForSalesforce.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com">
   <soapenv:Header>
      
      <urn:SessionHeader>
         <urn:sessionId>00D5g000004EupT!AQkAQKhIpi.cMwW7Iq4PMZIKPuv.4grQd8jf25Vy6kaEJzoAMGfxRSJK8Vasm0ENPfAa3tWHR2nWzu2CFpX4AeEVd5nfzW20</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:create>
         <!--Zero or more repetitions:-->
         <urn:sObjects xsi:type="urn1:Account" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <Name> Create SOAP Account</Name>
            <Industry> Agriculture ></Industry>
            <Type> Prospects</Type>
         </urn:sObjects>
      </urn:create>
   </soapenv:Body>
</soapenv:Envelope>